apache/nuttx/arch/arm/src/sam34/sam_spi.c
  spivdbg("txbuffer=%p rxbuffer=%p nwords=%d\n", txbuffer, rxbuffer, nwords);

  /* Set up PCS bits */

  pcs = spi_cs2pcs(priv) << SPI_TDR_PCS_SHIFT;

  /* Make sure that any previous transfer is flushed from the hardware */

  spi_flush();

  /* Loop, sending each word in the user-provied data buffer.
   *
   * Note 1: Right now, this only deals with 8-bit words.  If the SPI
   *         interface were configured for words of other sizes, this
   *         would fail.
   * Note 2: Good SPI performance would require that we implement DMA
   *         transfers!
   * Note 3: This loop might be made more efficient.  Would logic
   *         like the following improve the throughput?  Or would it
   *         just add the risk of overruns?
   *
   *   Get word 1;
   *   Send word 1;  Now word 1 is "in flight"
   *   nwords--;
   *   for ( ; nwords > 0; nwords--)
   *     {
   *       Get word N.
   *       Wait for TDRE meaning that word N-1 has moved to the shift
   *          register.
   *       Disable interrupts to keep the following atomic
   *       Send word N.  Now both work N-1 and N are "in flight"
   *       Wait for RDRF meaning that word N-1 is available
   *       Read word N-1.
   *       Re-enable interrupts.
   *       Save word N-1.
   *     }
   *   Wait for RDRF meaning that the final word is available
   *   Read the final word.
   *   Save the final word.
   */

  for ( ; nwords > 0; nwords--)
    {
      /* Get the data to send (0xff if there is no data source) */

      if (rxptr)
        {
          data = (uint32_t)*txptr++;
        }
      else
        {
          data = 0xffff;
        }

      /* Set the PCS field in the value written to the TDR */

      data |= pcs;

      /* Do we need to set the LASTXFER bit in the TDR value too? */

#ifdef CONFIG_SPI_VARSELECT
      if (nwords == 1)
        {
          data |= SPI_TDR_LASTXFER;
        }
#endif

      /* Wait for any previous data written to the TDR to be transferred
       * to the serializer.
       */

      while ((getreg32(SAM_SPI_SR) & SPI_INT_TDRE) == 0);

      /* Write the data to transmitted to the Transmit Data Register (TDR) */

      putreg32(data, SAM_SPI_TDR);

      /* Wait for the read data to be available in the RDR */

      while ((getreg32(SAM_SPI_SR) & SPI_INT_RDRF) == 0);

      /* Read the received data from the SPI Data Register */

      data = getreg32(SAM_SPI_RDR);
      if (rxptr)
        {
          *rxptr++ = (uint8_t)data;
        }
    }
}

/***************************************************************************
 * Name: spi_sndblock
 *
 * Description:
 *   Send a block of data on SPI
 *
 * Input Parameters:
 *   dev -    Device-specific state data
 *   buffer - A pointer to the buffer of data to be sent
 *   nwords - the length of data to send from the buffer in number of words.
 *            The wordsize is determined by the number of bits-per-word
 *            selected for the SPI interface.  If nbits <= 8, the data is
 *            packed into uint8_t's; if nbits >8, the data is packed into uint16_t's
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifndef CONFIG_SPI_EXCHANGE
static void spi_sndblock(FAR struct spi_dev_s *dev, FAR const void *buffer, size_t nwords)
{
  /* spi_exchange can do this. */

  spi_exchange(dev, buffer, NULL, nwords);
}
#endif

/****************************************************************************
 * Name: spi_recvblock
 *
 * Description:
 *   Revice a block of data from SPI
 *
 * Input Parameters:
 *   dev -    Device-specific state data
 *   buffer - A pointer to the buffer in which to recieve data
 *   nwords - the length of data that can be received in the buffer in number
 *            of words.  The wordsize is determined by the number of bits-per-word
 *            selected for the SPI interface.  If nbits <= 8, the data is
 *            packed into uint8_t's; if nbits >8, the data is packed into uint16_t's
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifndef CONFIG_SPI_EXCHANGE
static void spi_recvblock(FAR struct spi_dev_s *dev, FAR void *buffer, size_t nwords)
{
  /* spi_exchange can do this. */

  spi_exchange(dev, NULL, buffer, nwords);
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: up_spiinitialize
 *
 * Description:
 *   Initialize the selected SPI port
 *
 * Input Parameter:
 *   cs - Chip select number (identifying the "logical" SPI port)
 *
 * Returned Value:
 *   Valid SPI device structure reference on succcess; a NULL on failure
 *
 ****************************************************************************/

FAR struct spi_dev_s *up_spiinitialize(int cs)
{
  FAR struct sam_spidev_s *priv;
  irqstate_t flags;

  /* The support SAM parts have only a single SPI port */

  spivdbg("cs=%d\n", cs);
  DEBUGASSERT(cs >= 0 && cs <= SAM_SPI_NCS);

#ifdef CONFIG_SPI_OWNBUS
  /* There is only one device on the bus and, therefore, there is only one
   * supported chip select.  In this case, use the single, pre-allocated
   * chip select structure.
   */

  priv = &g_spidev;

#else
  /* Allocate a new state structure for this chip select.  NOTE that there
   * is no protection if the same chip select is used in two different
   * chip select structures.
   */

  priv = (FAR struct sam_spidev_s *)zalloc(sizeof(struct sam_spidev_s));
  if (!priv)
    {
      spivdbg("ERROR:  Failed to allocate a chip select structure\n", cs);
      return NULL;
    }
#endif

  /* Set up the initial state for this chip select structure.  Other fields
   * were zeroed by zalloc().
   */

  priv->spidev.ops = &g_spiops;
  priv->cs = cs;

#ifndef CONFIG_SPI_OWNBUS
  /* Has the SPI hardware been initialized? */

  if (!g_spinitialized)
#endif
    {
      /* Enable clocking to the SPI block */

      flags = irqsave();
      sam_spi_enableclk();

      /* Configure multiplexed pins as connected on the board.  Chip select
       * pins must be configured by board-specific logic.
       */

      sam_configgpio(GPIO_SPI0_MISO);
      sam_configgpio(GPIO_SPI0_MOSI);
      sam_configgpio(GPIO_SPI0_SPCK);

      /* Disable SPI clocking */

      putreg32(SPI_CR_SPIDIS, SAM_SPI_CR);

      /* Execute a software reset of the SPI (twice) */

      putreg32(SPI_CR_SWRST, SAM_SPI_CR);
      putreg32(SPI_CR_SWRST, SAM_SPI_CR);
      irqrestore(flags);

      /* Configure the SPI mode register */

      putreg32(SPI_MR_MSTR | SPI_MR_MODFDIS, SAM_SPI_MR);

      /* And enable the SPI */

      putreg32(SPI_CR_SPIEN, SAM_SPI_CR);
      up_mdelay(20);

      /* Flush any pending transfers */

      (void)getreg32(SAM_SPI_SR);
      (void)getreg32(SAM_SPI_RDR);

#ifndef CONFIG_SPI_OWNBUS
      /* Initialize the SPI semaphore that enforces mutually exclusive
       * access to the SPI registers.
       */

      sem_init(&g_spisem, 0, 1);
      g_spinitialized = true;
#endif
      spi_dumpregs("After initialization");
    }

  return &priv->spidev;
}
#endif /* CONFIG_SAM34_SPI */
